// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19, 4, 76, 3 -> [1, 2, 5, 7, 19,4,76,3]
// 6, 1, 33, 43, 12, 3 ,2, 9 -> [6, 1, 33,43,12,3,2,9

int[] Array = new int[8];
Random rand = new Random();
for (int i = 0; i < 8; i++)
{
    Array[i] = rand.Next(1,9);
    Console.Write(Array[i] + " ");
}
